In [19]:
import pandas as pd

In [20]:
df=pd.read_csv("C:\\Users\\HP\\Downloads\\sales_data.csv")
df
df.head(10)

         Date Region    Product  Quantity  Unit_Price  Total
0  2023-12-23  North  Product A       NaN         100   1700
1  2023-11-14   West        NaN      18.0         150   2700
2  2023-09-02  South  Product C      10.0         150   1500
3  2023-12-01  North  Product B      13.0         100   1300
4  2023-05-14   West  Product B      16.0         150   2400
5  2023-06-09   West  Product C       7.0         100    700
6         NaN   West  Product C      15.0         100   1500
7  2023-09-22   West  Product B       2.0         100    200
8  2023-05-07  South  Product A       5.0         200   1000
9  2023-01-14   West  Product C      17.0         150   2550

In [21]:
df.dtypes

Date           object
Region         object
Product        object
Quantity      float64
Unit_Price      int64
Total           int64
dtype: object

In [22]:
df.columns

Index(['Date', 'Region', 'Product', 'Quantity', 'Unit_Price', 'Total'], dtype='object')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        498 non-null    object
 1   Region      500 non-null    object
 2   Product     499 non-null    object
 3   Quantity    499 non-null    float64
 4   Unit_Price  500 non-null    int64
 5   Total       500 non-null    int64
dtypes: float64(1), int64(2), object(3)
memory usage: 23.6+ KB

In [29]:
pip install openpyxl

Collecting openpyxl
  Using cached openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Using cached et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Using cached openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Using cached et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

In [30]:
#to import excel file
import openpyxl
#pd.read_excel()
df=pd.read_excel("C:\\Users\\HP\\Desktop\\DigitalProducts.xlsx",
                 sheet_name='Order_table')
df

   orderId productId  Qty  payMode
0      101        p1    1   online
1      102        p2    4   online
2      103        p4    2  offline
3      104        p1    3   online
4      105        p2    2   online
5      106        p3    4   online
6      107        p4    5  offline
7      108        p2    2  offline
8      109        p3    4   online
9      110        p1    2  offline

In [31]:
df=pd.read_excel("C:\\Users\\HP\\Desktop\\DigitalProducts.xlsx",
                 sheet_name='product')
df

  ProductId ProductName  CostPrice  SellingPrice  Stock
0        p1      Laptop      10000         20000     10
1        p2     Printer     100000        300000     20
2        p3          Ac      15000         25000     20
3        p4          TV      12000         15000     15

In [34]:
data={
     'Name':['AAAA','BBBBB','CCCCC','DDDDD'],
      'age':[10,13,25,23],
       'marks':[74.23,67.4,25.3,23.23]
}
df=pd.DataFrame(data)
df

    Name  age  marks
0   AAAA   10  74.23
1  BBBBB   13  67.40
2  CCCCC   25  25.30
3  DDDDD   23  23.23

In [36]:
#Export the data
df.to_csv("C:\\Users\\HP\\Desktop\\pandas_12pm\\new_data.csv")

In [37]:
df.to_csv("C:\\Users\\HP\\Desktop\\pandas_12pm\\new_data2.csv",index=True)

In [38]:
df.to_json('C:\\Users\\HP\\Desktop\\pandas_12pm\\new_data2.json', 
           orient='records')  # List of records

In [39]:
df.to_excel('C:\\Users\\HP\\Desktop\\pandas_12pm\\new_data2.xlsx',
            sheet_name="Sheet1")  # List of records